[
  {
    "path": "posts/2021-05-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of the data visualisation on merchandise trade in Singapore.",
    "author": [
      {
        "name": "LIU Yangguang",
        "url": "https://www.linkedin.com/in/ygliu/"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualization\r\n2.0 Alternative Design\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Preparation\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualization\r\nThe original visualization are shown as below.\r\n\r\n1.1 Clarity\r\nThe dual axis in each chart have different ranges. It would make the reader difficult to compare the amount of import and export.\r\nThe range of y axis in the six charts are different. Reader need extra effort to compare the trade amount of different countries. They have to look at the y coordinate scales separately in the six charts to get and compare the number.\r\nThe six charts have different widths. The different width will influence the reader how to interpret the change of the amount. If the width of the same x axis in the graph is longer, the data fluctuation will seem to be smaller.\r\nThe order of the six charts is inaccurate. The title is “Top Six Trading Countries”, which makes the reader think that the six charts are ordered by trade amount of each country.\r\n1.2 Aesthetic\r\nThe x-axis scale is confusing. It is not consistent with the axis title. The title is shown as ‘Month’, but the tick marker is year. Besides, the chart of the ‘Japan’ is not the same as the x-axis markings of other countries.\r\nFont size and color are confusing. The gray color of the head’s font is consistent with the black font of other labels. Besides, the font of the country is too large, even larger than the title.\r\nThe coordinates are repeated six times. They take up so much space in the picture that the area charts are very small.\r\n2.0 Alternative Design\r\nThe proposed design is shown as bellow. 插入手写的草图\r\n2.1 Clarity\r\nThe dual axis use the same scale in the six charts. It makes it easier to compare imports and exports amounts or trade amount among countries.\r\nThe six charts have the same height and width.\r\nThe six charts are reorder by the total merchandise trade amount in the period.\r\n2.2 Aesthetic\r\nThe x axis titles are changed to the ‘Date’, consistent with the tick marks. All charts have the same axis.\r\n2.The color of all text is unified. The country fonts have been changed to smaller font sizes to highlight the captions of the images\r\nThe unnecessary axis title are hidden.\r\n3.0 Proposed Visualization\r\n插入修改后的图片\r\nThe link to the original dashboard on Tableau Public Server can be found here.\r\n4.0 Step-by-step Preparation\r\nThe original data is from Department of Statistics in Singapore, available under the sub-section of Merchandise Trade by Region/Market.\r\nNo.\r\nStep\r\nAction\r\n1\r\nImport the data into Tableau and click “Cleaned with Data Interpreter” to get the cleaned table\r\n\r\n2\r\nDrag and drop T1 sheet to the canvas area\r\n\r\n3\r\nSelect all the date variables, right click and choose the pivot to make date variables into one\r\n\r\n4\r\nChoose the T2 sheet and use the same approach to get the pivoted table\r\n\r\n5\r\nRight click on the “variables” and select “split” to get the cleaned region name, then rename it into “Region”\r\n\r\n6\r\nHide “Variable” and “Variable - split 2” and rename the variables into meaningful name\r\n\r\n7\r\nChange data type of the “Date” variable from string to date in the two table\r\n\r\n8\r\nEdit the connection between two tables to add one rule\r\n\r\n9\r\nAdd the “Date” variable into the Filters panel and select only 2019 and 2020\r\n\r\n10\r\nAdd the “Region” variable into the Filters panel and select the six region in the original designed visualization\r\n\r\n11\r\nAdd “Region” and “Date”(month) to the Columns; Add “Exports” to the Rows; Change the marks from Automatic to Area\r\n\r\n12\r\nDrag the “Imports” to the left of the charts to get the dual axis\r\n\r\n13\r\nEdit the dual y axis into the same range: 0 to 8,000,000\r\n\r\n14\r\nEdit the x axis into the fixed range\r\n\r\n15\r\nRight click on the “Region” and choose sort to manual sort the six regions by the total merchandise trade amount from 2019 to 2020\r\n\r\n16\r\nIt’s too crowded for the six graph in one columns to read the data trend: Rearrange them into two graph. Duplicate the worksheet and use filter to select the corresponding three countries in the two worksheet\r\n\r\n17\r\nDrag and drop the two worksheet to the dashboard\r\n\r\n18\r\nHide the title and the field labels in the second sheet; Hide the x header in the first sheet; Hide the “Imports” header in the two sheets\r\n\r\n19\r\nRename the title, headers and labels for better clarity\r\n\r\n20\r\nChange the font and tick color to be consistent and publish the dashboard to Tableau Public\r\n\r\n5.0 Derived Insights\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T01:23:17+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-my-ist-post/",
    "title": "My Ist Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nTo insert a graph.\r\n\r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\n’’’{r} fa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3) ’’’\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T12:01:57+08:00",
    "input_file": {}
  }
]
